"""User bot statistics texts."""

BETTING_STAT_INDICATORS = "Показатели статистики ставок:"

BETTING_STAT_MODE = "Выбери режим статистики ставок:"

STAT_CHOOSE_YEAR = (
    "Выбери год(а) для статистики и нажми 'Готово'. По умолчанию будет статистика за текущий год."
)

STAT_CHOOSE_PARAMS = "Выбери показател(ь/и) статистики и нажми 'Готово'. По умолчанию: для статистики ставок — 'Денег выиграно', для текущих турниров — 'Баллы'."

BET_STAT_CHOOSE_SORT = "Выбери показателя для сортировки: "

BET_STAT_CHOOSED_SORT_DEFAULT = "По умолчанию будет сортировка по первому элементу."

BETTING_STAT_SELECTED = "Выбран показатель: {indicator}"

BETTING_STAT_REPORT = "Статистика ставок:\n\n{report}"

STAT_EXPORT_CANCELED = "Выгрузка статистики отменена."

POKER_STAT_BTN = "Здесь про статистику покера. Важно: в статистику попадают игроки, участвовавшие в 30% игр за выбранный период!"

POKER_STAT_INDICATORS = "Показатели статистики покера:"

STAT_CHOOSE_SORT = "Выбери показателя для сортировки: "

STAT_CHOOSED_SORT_DEFAULT = "По умолчанию будет сортировка по первому элементу."

POKER_STAT_REPORT = "Статистика покера:\n\n{report}"
